# Pandas

- O Pandas é uma biblioteca do Python que fornece ferramentas de análise de dados e estruturas de dados de alta performance e fáceis de usar.
- Por ser a principal e mais completa biblioteca para estes objetivos, o Pandas é fundamental para Análise de Dados.
- É muito comum que os dados que analisamos estejam dispostos em formato de tabelas, sobretudo, quando falamos em análise estatística de dados.
- Esses dados, no formato de tabela, podem apresentar, por exemplo, colunas que trazem diferentes atributos do dado, e linhas que trazem um conjunto de observações.
- Para exemplificar, [veja esse dataset](https://en.wikipedia.org/wiki/Iris_flower_data_set).

Para nos ajudar a lidar com esses dados em formato de tabelas, o Pandas nos fornece um objeto, chamado DataFrame, que é capaz de armazenar e manipular esse tipo de dado de uma forma equivalente às planilhas de Excel.

In [2]:
# Importação das bibliotecas
import numpy as np
import pandas as pd

# Series

A `Series` é como uma coluna ou uma linha do nosso DataFrame (tabela). Embora possa parecer que esse objeto é idêntico a um Numpy array, ele possui atributos distintos, os quais vamos estudar agora.

In [ ]:
# Um exemplo usando os passos que eu dei na semana
steps = pd.Series([4126, 3867, 7934, 4180, 5344])

In [ ]:
steps

0    4126
1    3867
2    7934
3    4180
4    5344
dtype: int64

In [ ]:
type(steps)

pandas.core.series.Series

## Como retornar os valores da série

In [ ]:
steps.values

array([4126, 3867, 7934, 4180, 5344])

## Como retorna os indices do série

In [ ]:
# range de 0 a 5 com passo 1
steps.index

RangeIndex(start=0, stop=5, step=1)

## Como nomear cada índice

In [ ]:
steps = pd.Series(data=[4126, 3867, 7934, 4180, 5344], index=['seg', 'ter', 'qua', 'qui', 'sex'])

In [ ]:
steps

seg    4126
ter    3867
qua    7934
qui    4180
sex    5344
dtype: int64

In [ ]:
steps.index

Index(['seg', 'ter', 'qua', 'qui', 'sex'], dtype='object')

## Funções do Numpy

> Lembrando que o valor de uma Serie é retornado em forma de array, ou seja, é possível utilizar as funções do Numpy.

In [ ]:
steps.min()

3867

In [ ]:
steps.max()

7934

In [ ]:
steps.mean()

5090.2

In [ ]:
steps.sum()

25451

## Para visualizar um conjunto de informações

In [ ]:
steps.describe()

count       5.000000
mean     5090.200000
std      1688.636787
min      3867.000000
25%      4126.000000
50%      4180.000000
75%      5344.000000
max      7934.000000
dtype: float64

Essa estrutura é bem flexível. Veja alguns exemplos do que você pode fazer com ela:

In [ ]:
steps * 2

seg     8252
ter     7734
qua    15868
qui     8360
sex    10688
dtype: int64

In [ ]:
np.sqrt(steps)

seg    64.233947
ter    62.185207
qua    89.073004
qui    64.652920
sex    73.102668
dtype: float64

## Criando uma series com dicionários

In [ ]:
dic = {'python': 10, 'javascript': 9, 'matlab':7}

In [ ]:
series = pd.Series(dic)

In [ ]:
series

python        10
javascript     9
matlab         7
dtype: int64

## Indexação

In [ ]:
s = pd.Series(data=np.random.randint(1, 5, 10), index=['A B C D E F G H I J'.split()])

In [ ]:
s

A    3
B    4
C    2
D    4
E    3
F    4
G    2
H    1
I    1
J    3
dtype: int64

In [ ]:
s[0]

3

In [ ]:
s['A']

3

In [ ]:
s[2:4]

C    2
D    4
dtype: int64

In [ ]:
s['C':'D']

C    2
D    4
dtype: int64

## Operações

In [ ]:
s1 = pd.Series(data=np.random.randint(1, 100, 3), index='facebook instagram youtube'.split())

In [ ]:
s2 = pd.Series(data=np.random.randint(1, 100, 3), index='facebook instagram tiktok'.split())

In [ ]:
s1

facebook     84
instagram    26
youtube      80
dtype: int64

In [ ]:
s2

facebook     45
instagram    67
tiktok       23
dtype: int64

In [ ]:
s1 + s2

facebook     129.0
instagram     93.0
tiktok         NaN
youtube        NaN
dtype: float64

In [ ]:
s1 - s2

facebook     39.0
instagram   -41.0
tiktok        NaN
youtube       NaN
dtype: float64

## Mascaras

In [ ]:
s

A    3
B    4
C    2
D    4
E    3
F    4
G    2
H    1
I    1
J    3
dtype: int64

### Retornando os valores maiores de 2

In [ ]:
s[s > 2]

A    3
B    4
D    4
E    3
F    4
J    3
dtype: int64

Apenas os índices dos maiore de 2:

In [ ]:
s[s > 2].index

MultiIndex([('A',),
            ('B',),
            ('D',),
            ('E',),
            ('F',),
            ('J',)],
           )

# DataFrame

DataFrame é capaz de armazenar e manipular esse tipo de dado de uma forma equivalente às planilhas de Excel.

> DataFrame é com conjunto de Series

In [ ]:
dados = np.array([[72, 180, 26], [80, 170, 19], [60, 165, 15]])

dados

array([[ 72, 180,  26],
       [ 80, 170,  19],
       [ 60, 165,  15]])

In [ ]:
df = pd.DataFrame(data=dados, columns=['Peso', 'Altura', 'Idade'])
df

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

## Indexação

In [ ]:
df['Altura']

0    180
1    170
2    165
Name: Altura, dtype: int64

> DataFrame é um conjunto de Series

In [ ]:
type(df['Altura'])

pandas.core.series.Series

### Para acessar as linhas (índice)

In [ ]:
df.loc[1]

Peso       80
Altura    170
Idade      19
Name: 1, dtype: int64

### Para acessar um dado especifico

In [ ]:
df['Altura'][1]

170

In [ ]:
df.loc[1]['Altura']

170

### Acessando mais de uma coluna

In [ ]:
df[['Peso', 'Altura']]

   Peso  Altura
0    72     180
1    80     170
2    60     165

### Acessando dado com índices númericos

In [ ]:
df.iloc[2][1]

165

# Lendo e salvando Datasets (CSV, XlSX, HTML)

Obs: pode ser importante instalar os pacotes xlrd e openpyxl.

In [6]:
df = pd.read_csv('datasets/titanic_train.csv', sep=',')

In [7]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
# Visualizar as 5 primerias linhas
df.head()
# Vc pode colocar como parametro a quantidade de linhas que seja visualizar.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
# visualizar os 5 últimos parametross
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [10]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Para ler arquivos Excel

In [13]:
df = pd.read_excel('datasets/peso-altura.xlsx')

Poderia usar o parametro sheet_name='' para renomear ou abrir somente as abas indicadas.

In [14]:
df.head()

   Massa corporal (kg)  Altura (cm)
0                   72          180
1                   80          170
2                   60          175
3                   90          174
4                  100          185

In [15]:
df.shape

(20, 2)

### Salvando arquivo como CSV

In [16]:
df.to_csv('datasets/peso-altura.csv')

## Lendo tabelas HTML

In [4]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [5]:
df

[                         Bank NameBank       CityCity StateSt  CertCert  \
 0             Heartland Tri-State Bank        Elkhart      KS     25851
 1                  First Republic Bank  San Francisco      CA     59017
 2                       Signature Bank       New York      NY     57053
 3                  Silicon Valley Bank    Santa Clara      CA     24735
 4                    Almena State Bank         Almena      KS     15426
 ..                                 ...            ...     ...       ...
 562                 Superior Bank, FSB       Hinsdale      IL     32646
 563                Malta National Bank          Malta      OH      6629
 564    First Alliance Bank & Trust Co.     Manchester      NH     34264
 565  National State Bank of Metropolis     Metropolis      IL      3815
 566                   Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                 Dream First Bank, N.A.       July 28, 2023     10544
 1              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 2                    Flagstar Bank, N.A.      March 12, 2023     10540
 3    First–Citizens Bank & Trust Company      March 10, 2023     10539
 4                            Equity Bank    October 23, 2020     10538
 ..                                   ...                 ...       ...
 562                Superior Federal, FSB       July 27, 2001      6004
 563                    North Valley Bank         May 3, 2001      4648
 564  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 565              Banterra Bank of Marion   December 14, 2000      4646
 566                   Bank of the Orient    October 13, 2000      4645

 [567 rows x 7 columns]]

## Analisando e Filtrando Dados

In [2]:
import pandas as pd
import numpy as np

In [3]:
# Carregando o dataset
df = pd.read_csv('datasets/titanic_train.csv')

In [21]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
# Ver quais sao os labels das colunas
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
# Os índices, de 0 até 891 de 1 em 1
df.index

RangeIndex(start=0, stop=891, step=1)

In [7]:
# Retorna os valores unificados
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [8]:
df['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [9]:
# Contar quantos se cada sexo há no navio
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [10]:
df['Age'].value_counts()

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

### Métodos estatísticos

In [11]:
df['Age'].mean()

29.69911764705882

In [12]:
df['Age'].median()

28.0

In [13]:
df['Age'].mode()

0    24.0
Name: Age, dtype: float64

In [14]:
df['Age'].std()

14.526497332334042

In [15]:
df['Age'].var()

211.01912474630802

In [16]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [17]:
# Conferir se tem dados duplicados
df.duplicated().sum()

0

In [18]:
# Retorna um novo dataframe sem dados duplicados
df.drop_duplicates()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Filtragem de dados (Máscaras)

In [19]:
df['Age'] > 25

0      False
1       True
2       True
3       True
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [20]:
# Um dataframe com idades acima de 25
df[df['Age'] > 25]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
df[df['Age'] > df['Age'].mean()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
df[df['Sex'] == 'female']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

### Exercícios

O arquivo avocado.csv é data.set que contém informações sobroe abacates que foram vendidos, entre os anos de 2015 à 2018, em algumas regiões dos Estados unidos. Carregue esse dataset em um DataFrame(DF) e, em seguinda:

a) Visualize as primeiras linhas desse DF utilizando o método `head`.

b) Visualize as cinco primeiras linhas desse DF utilizando o método `tail`.

c) Visualize as principais informações sobre esse DF utilizando o método `info`.

d) Imprima a lista dos _labels_ das colunas desse DF.

e) Exiba quantos abacates são do tipo (type) Convencional e quantos são do tipo orgânico.

f) Exiba as regiões (region) que estão presentes nesse dataset.

g) Filtre os dados da regido da 'California' e salve-os em um novo DF.

h) Qual foi o volume total (Total Volume) médio vendido nessa regido?

# Criando e removendo colunas DataFrame

In [52]:
import numpy as np
import pandas as pd
from random import choice

In [53]:
df = pd.read_excel('datasets/peso-altura.xlsx')

In [54]:
df.head()

   Massa corporal (kg)  Altura (cm)
0                   72          180
1                   80          170
2                   60          175
3                   90          174
4                  100          185

In [55]:
df.shape

(20, 2)

In [56]:
# Criando uma array aleatória entre 17 e 39, com 20 valores
idade = np.random.randint(17, 40, 20)

In [57]:
idade

array([35, 39, 35, 30, 24, 23, 37, 24, 39, 27, 25, 30, 27, 23, 36, 23, 32,
       30, 25, 17])

In [58]:
df['Idade'] = idade

In [59]:
df.head()

   Massa corporal (kg)  Altura (cm)  Idade
0                   72          180     35
1                   80          170     39
2                   60          175     35
3                   90          174     30
4                  100          185     24

In [60]:
# Criando uma lista chamada sexo com valores
# Aleatórios entre "M" ou "F" de tamanho 20.
sexo = [choice(['M', 'F']) for i in range(20)]

In [61]:
sexo

['F',
 'M',
 'F',
 'M',
 'M',
 'F',
 'M',
 'M',
 'M',
 'F',
 'M',
 'F',
 'M',
 'M',
 'M',
 'F',
 'M',
 'F',
 'F',
 'M']

In [62]:
df['Sexo'] = sexo

In [63]:
df.head()

   Massa corporal (kg)  Altura (cm)  Idade Sexo
0                   72          180     35    F
1                   80          170     39    M
2                   60          175     35    F
3                   90          174     30    M
4                  100          185     24    M

In [64]:
# Apenas retorna o DataFrame com a coluna deletada
df.drop('Altura (cm)', axis=1)

    Massa corporal (kg)  Idade Sexo
0                    72     35    F
1                    80     39    M
2                    60     35    F
3                    90     30    M
4                   100     24    M
5                   120     23    F
6                    82     37    M
7                    79     24    M
8                    78     39    M
9                    55     27    F
10                   71     25    M
11                   75     30    F
12                  130     27    M
13                  105     23    M
14                   60     36    M
15                   54     23    F
16                   58     32    M
17                   57     30    F
18                   60     25    F
19                   62     17    M

In [65]:
df

    Massa corporal (kg)  Altura (cm)  Idade Sexo
0                    72          180     35    F
1                    80          170     39    M
2                    60          175     35    F
3                    90          174     30    M
4                   100          185     24    M
5                   120          190     23    F
6                    82          182     37    M
7                    79          179     24    M
8                    78          165     39    M
9                    55          165     27    F
10                   71          170     25    M
11                   75          169     30    F
12                  130          177     27    M
13                  105          173     23    M
14                   60          172     36    M
15                   54          162     23    F
16                   58          163     32    M
17                   57          167     30    F
18                   60          171     25    F
19                   62          181     17    M

In [66]:
# Deletando a coluna do DataFrame
# df = df.drop('Altura (cm)', axis=1)

In [67]:
# Deletando a coluna do DataFrame usando parametro do drop
df.drop('Altura (cm)', axis=1, inplace=True)

In [68]:
df

    Massa corporal (kg)  Idade Sexo
0                    72     35    F
1                    80     39    M
2                    60     35    F
3                    90     30    M
4                   100     24    M
5                   120     23    F
6                    82     37    M
7                    79     24    M
8                    78     39    M
9                    55     27    F
10                   71     25    M
11                   75     30    F
12                  130     27    M
13                  105     23    M
14                   60     36    M
15                   54     23    F
16                   58     32    M
17                   57     30    F
18                   60     25    F
19                   62     17    M

# Tratamento de dados ausentes

Métodos:
- `isnull`
- `dropna`
- `fillna`

In [69]:
import pandas as pd
import numpy as np

In [70]:
dados = np.array([[1, 2, np.nan],
                  [4, np.nan, np.nan],
                  [7, 8, 9]])
df = pd.DataFrame(dados, columns='A B C'.split())

In [71]:
df

     A    B    C
0  1.0  2.0  NaN
1  4.0  NaN  NaN
2  7.0  8.0  9.0

## Is null?

In [72]:
# Retorna os dados nulos com True
df.isnull()

       A      B      C
0  False  False   True
1  False   True   True
2  False  False  False

In [74]:
df['A'].isnull()

0    False
1    False
2    False
Name: A, dtype: bool

In [75]:
df['B'].isnull()

0    False
1     True
2    False
Name: B, dtype: bool

In [76]:
df['B'].isnull().sum()

1

In [77]:
df['C'].isnull().sum()

2

## Dropna()

In [78]:
# Remoção baseada na linha
# Exclui a linha com dados ausentes
df.dropna()

     A    B    C
2  7.0  8.0  9.0

In [79]:
# Remoção baseada na coluna
df.dropna(axis=1)

     A
0  1.0
1  4.0
2  7.0

## Fillna() - preencher dados ausentes

In [97]:
# substituindo os dados ausentes da coluna B por 0
df['B'] = df['B'].fillna(0)

In [98]:
# Retornando o preenchimento dos dados ausentes com 0 em todo o DataFrame
df.fillna(0)

     A    B    C
0  1.0  2.0  0.0
1  4.0  0.0  0.0
2  7.0  8.0  9.0

In [99]:
# Pega o valor seguente e joga para o dado ausente
df.fillna(method='bfill')

     A    B    C
0  1.0  2.0  9.0
1  4.0  0.0  9.0
2  7.0  8.0  9.0

In [100]:
df['B'][1] = np.nan

In [101]:
df

     A    B    C
0  1.0  2.0  NaN
1  4.0  NaN  NaN
2  7.0  8.0  9.0

In [103]:
# Pega o valor antecedente e joga para o dado ausente
df.fillna(method='ffill')

     A    B    C
0  1.0  2.0  NaN
1  4.0  2.0  NaN
2  7.0  8.0  9.0

## Exemplo titanic

In [104]:
df = pd.read_csv('datasets/titanic_train.csv')

In [106]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [107]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [108]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [109]:
df.shape

(891, 12)

In [110]:
687 / 891 * 100

77.10437710437711

In [111]:
df.drop('Cabin', axis=1, inplace=True)

In [112]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [113]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [115]:
df['Embarked'].fillna('S', inplace=True)

In [116]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

In [117]:
177 / 891 * 100

19.865319865319865

In [119]:
media_idade = df['Age'].mean()

In [120]:
df['Age'].fillna(media_idade, inplace=True)

In [121]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64